УТ.УчетЗадач/src/InformationRegisters/cbr_Б24_Настройки/cbr_Б24_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_Б24_Настройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.cbr_ВидыПользовательскихНастроек</types>
      <types>Boolean</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.cbr_Б24_Настройки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.cbr_ПриоритетыЗадач</types>
      <types>CatalogRef.cbr_СтатусыЗадач</types>
      <types>String</types>
      <types>CatalogRef.cbr_Приоритеты</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_Б24_Настройки/ManagerModule.bsl
Функция ПолучитьНастройкиИзРегистра(Знач ТипНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_Б24_Настройки.Настройка,
		|	cbr_Б24_Настройки.Значение
		|ИЗ
		|	РегистрСведений.cbr_Б24_Настройки КАК cbr_Б24_Настройки
		|ГДЕ
		|	cbr_Б24_Настройки.ТипНастройки = &ТипНастройки";
	
	Запрос.УстановитьПараметр("ТипНастройки", ТипНастройки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	НастройкиБитрикс = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		НастройкиБитрикс.Вставить(Выборка.Настройка, Выборка.Значение);
	КонецЦикла;
	
	Возврат НастройкиБитрикс;
	
КонецФункции
